Revit 2026 API

# BuiltInFailuresSelectionFailures Class

---

Failures about Selections.

SystemObject Autodesk.Revit.DBBuiltInFailuresSelectionFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class SelectionFailures
```
```vb
Public NotInheritable Class SelectionFailures
```
```cpp
public ref class SelectionFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type SelectionFailures = class end
```

The BuiltInFailuresSelectionFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | NoElementSelected | No element selected. |
|  | NoValidElementSelected | No valid element selected. |

#### Reference

Autodesk.Revit.DB Namespace